<a href="https://colab.research.google.com/github/I-ownthispage/Mypage/blob/master/ClassifierModel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [135]:
import pandas as pd
import numpy as nm 
from sklearn.model_selection import train_test_split
from sklearn.feature_extraction.text import CountVectorizer,TfidfVectorizer
from sklearn.naive_bayes import MultinomialNB
from sklearn.metrics import accuracy_score
import string
import matplotlib.pyplot as plt
%matplotlib inline

In [117]:
dset = pd.read_csv("/content/spam.tsv",sep='\t',names=['Class','Message'])
dset.head(8)

  Class                                            Message
0   ham  I've been searching for the right words to tha...
1  spam  Free entry in 2 a wkly comp to win FA Cup fina...
2   ham  Nah I don't think he goes to usf, he lives aro...
3   ham  Even my brother is not like to speak with me. ...
4   ham               I HAVE A DATE ON SUNDAY WITH WILL!!!
5   ham  As per your request 'Melle Melle (Oru Minnamin...
6  spam  WINNER!! As a valued network customer you have...
7  spam  Had your mobile 11 months or more? U R entitle...

In [113]:
dinfo=dset.info()
dinfo

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5567 entries, 0 to 5566
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Class    0 non-null      float64
 1   Message  5567 non-null   object
 2   Length   5567 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 130.6+ KB

In [118]:
dset.describe()

       Class                 Message
count   5567                    5567
unique     2                    5164
top      ham  Sorry, I'll call later
freq    4821                      30

In [119]:
dset['Length'] = dset['Message'].apply(len)

In [120]:
dset.head(8)

  Class                                            Message  Length
0   ham  I've been searching for the right words to tha...     196
1  spam  Free entry in 2 a wkly comp to win FA Cup fina...     155
2   ham  Nah I don't think he goes to usf, he lives aro...      61
3   ham  Even my brother is not like to speak with me. ...      77
4   ham               I HAVE A DATE ON SUNDAY WITH WILL!!!      36
5   ham  As per your request 'Melle Melle (Oru Minnamin...     160
6  spam  WINNER!! As a valued network customer you have...     157
7  spam  Had your mobile 11 months or more? U R entitle...     154

In [121]:
dset.groupby('Class').count()

       Message  Length
Class
ham       4821    4821
spam       746     746

In [122]:
dset['Length'].describe()

count    5567.000000
mean       80.450512
std        59.892646
min         2.000000
25%        36.000000
50%        62.000000
75%       122.000000
max       910.000000
Name: Length, dtype: float64

In [123]:
dset[dset['Length']==910]['Message'].iloc[0]

"For me the love should start with attraction.i should feel that I need her every time around me.she should be the first thing which comes in my thoughts.I would start the day and end it with her.she should be there every time I dream.love will be then when my every breath has her name.my life should happen around her.my life will be named to her.I would cry for her.will give all my happiness and take all her sorrows.I will be ready to fight with anyone for her.I will be in love when I will be doing the craziest things for her.love will be when I don't have to proove anyone that my girl is the most beautiful lady on the whole planet.I will always be singing praises for her.love will be when I start up making chicken curry and end up makiing sambar.life will be the most beautiful then.will get every morning and thank god for the day because she is with me.I would like to say a lot..will tell later.."

In [124]:
dObject = dset['Class']
dObject

0        ham
1       spam
2        ham
3        ham
4        ham
        ...
5562    spam
5563     ham
5564     ham
5565     ham
5566     ham
Name: Class, Length: 5567, dtype: object

In [128]:
dset.loc[dset['Class']=="ham","Class"] = 1

In [129]:
dset.loc[dset['Class']=="spam","Class"] = 0

In [140]:
dObject2=dset['Class']
dObject2
dObject2 = dObject2.astype(str).astype(int)
print(dObject2)

0       1
1       0
2       1
3       1
4       1
       ..
5562    0
5563    1
5564    1
5565    1
5566    1
Name: Class, Length: 5567, dtype: int64

In [141]:
dset.head(8)

   Class                                            Message  Length
0      1  Ive been searching for the right words to than...     196
1      0  Free entry in 2 a wkly comp to win FA Cup fina...     155
2      1  Nah I dont think he goes to usf he lives aroun...      61
3      1  Even my brother is not like to speak with me T...      77
4      1                  I HAVE A DATE ON SUNDAY WITH WILL      36
5      1  As per your request Melle Melle Oru Minnaminun...     160
6      0  WINNER As a valued network customer you have b...     157
7      0  Had your mobile 11 months or more U R entitled...     154

In [142]:
def cleanMessage(message):
    nonPunc = [char for char in message if char not in string.punctuation]
    nonPunc = "".join(nonPunc)
    return nonPunc

In [143]:
dset['Message'] = dset['Message'].apply(cleanMessage)

In [163]:
dset.head(8)

   Class                                            Message  Length
0      1  Ive been searching for the right words to than...     196
1      0  Free entry in 2 a wkly comp to win FA Cup fina...     155
2      1  Nah I dont think he goes to usf he lives aroun...      61
3      1  Even my brother is not like to speak with me T...      77
4      1                  I HAVE A DATE ON SUNDAY WITH WILL      36
5      1  As per your request Melle Melle Oru Minnaminun...     160
6      0  WINNER As a valued network customer you have b...     157
7      0  Had your mobile 11 months or more U R entitled...     154

In [164]:
dset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5567 entries, 0 to 5566
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Class    5567 non-null   int64
 1   Message  5567 non-null   object
 2   Length   5567 non-null   int64
dtypes: int64(2), object(1)
memory usage: 130.6+ KB

In [165]:
CV = CountVectorizer(stop_words="english")

In [ ]:
print(CV)

In [172]:
x = dset['Message']
y = dset['Class'].values

In [173]:
x_train,x_test,y_train,y_test = train_test_split(x, y, test_size=0.20, random_state=101)

print('Number of rows in the total set: {}'.format(dset.shape[0]))
print('Number of rows in the training set: {}'.format(x_train.shape[0]))
print('Number of rows in the test set: {}'.format(x_test.shape[0]))

Number of rows in the total set: 5567
Number of rows in the training set: 4453
Number of rows in the test set: 1114

In [174]:
x_train_CV = CV.fit_transform(x_train)

In [175]:
NB = MultinomialNB()
NB.fit(x_train_CV,y_train)

MultinomialNB(alpha=1.0, class_prior=None, fit_prior=True)

In [176]:
x_test_CV = CV.transform(x_test)

In [177]:
y_predict = NB.predict(x_test_CV)

In [184]:
from sklearn.metrics import confusion_matrix

confusion_m=confusion_matrix(y_test,y_predict)

print(confusion_m)

[[129  15]
 [  6 964]]

In [178]:
accuracyScore = accuracy_score(y_test,y_predict)*100

In [179]:
print("Prediction Accuracy :",accuracyScore)

Prediction Accuracy : 98.1149012567325

In [189]:
msg = input("Enter Message: ")
msgInput = CV.transform([msg])
predict = NB.predict(msgInput)
if(predict[0]==0):
  {
    print("------------------------MESSAGE-SENT-[CHECK-SPAM-FOLDER]---------------------------")
    
  }
else:
    print("---------------------------MESSAGE-SENT-[CHECK-INBOX]------------------------------")

Enter Message: You win 1000$
------------------------MESSAGE-SENT-[CHECK-SPAM-FOLDER]---------------------------